extends Sprite2D

var 进入鼓点 = false
@onready var 樱花特效 = $"ParallaxBackground/ParallaxLayer/樱花特效"
@onready var 速度框动画 = $"../GUI/速度显示框/速度动画"
@onready var tick = $"../Tick"
@onready var 歌词 = $"歌词"
@onready var 极速时间动画 = $"../极速时间2"

@onready var 小人动画 = $"../GUI/动画小人/动漫小人动画"

var 难度
var 歌曲已到达多少秒:int = 0


func _ready():
	歌曲已到达多少秒 = 0

	
func _process(delta):
	歌词_转换()
	难度 = Globals.难度等级检测
	
func 接收_难度_等级():
	Singals.connect("难度_等级_传递", 难度)
	

func 开局_倍速():
	速度框动画.play("一速")
	if 难度 == 3:
		tick.wait_time = 0.8
	elif 难度 == 4:
		tick.wait_time = 0.5

func 二_倍速():
	速度框动画.play("二速")
	if 难度 == 3:
		tick.wait_time = 0.6
	elif 难度 == 4:
		tick.wait_time = 0.3

func 三_倍速():
	速度框动画.play("三速")
	if 难度 == 3:
		tick.wait_time = 0.2
	if 难度 == 4:
		tick.wait_time = 0.1

	
func 极速_时间():
	速度框动画.play("三速")
	极速时间动画.play("极速时间")
	$"../极速时间2/极速语音".play()
	if 难度 == 3:
		tick.wait_time = 0.1
	if 难度 == 4:
		tick.wait_time = 0.05
	
func 歌词_转换():
	if 歌曲已到达多少秒 == 0:
		歌词.text = "樱之诗"
		
	if 歌曲已到达多少秒 == 10:
		歌词.text = "サクラノ詩 
					ヴォーカルCD"
	if 歌曲已到达多少秒 == 15:
		歌词.text = "PC游戏
					《樱之诗 -樱花林上飞舞-》
					主题歌集"
	if 歌曲已到达多少秒 == 32:
		歌词.text = "奔る光の螺旋
		
					穿梭的光之螺旋"
	if 歌曲已到达多少秒 == 37:
		歌词.text = "吹き上がる音と
					言葉の即興劇
					
					那是激响的春音与
					言语的即兴剧"
	if 歌曲已到达多少秒 == 44:
		歌词.text = "櫻の刻を奏でよ 
					はじまりへ
					
					奏响那樱花的刻印吧 
					迈向新生"
	if 歌曲已到达多少秒 == 53:
		歌词.text = "風の筆 射す 春日花抄
		
					执风为笔 
					光影婆娑 
					春日花抄"
	if 歌曲已到达多少秒 == 58:
		歌词.text = "その力に身をまかせよう
		
					委身于这股力量吧"
	if 歌曲已到达多少秒 == 65:
		歌词.text = "恐れなどいらない
		
					如今又何需恐慌"
	if 歌曲已到达多少秒 == 69:
		歌词.text = "足が立つこの大地 
					櫻舞う
					
					我们所立足的这片大地 
					此刻樱花乱舞"
	if 歌曲已到达多少秒 == 79:
		歌词.text = "歌声はあなたに
					響くだろうか
					
					歌声可会在你的
					心中回响？"
	if 歌曲已到达多少秒 == 85:
		歌词.text = "世界の限界を
					こえる詩を
					
					这首超越
					现世界限的诗歌"
	if 歌曲已到达多少秒 == 91:
		歌词.text = "この筆にのせて 
					とどけよ
					
					将承载于这支笔杆上 
					传达给你哟"
	if 歌曲已到达多少秒 == 94:
		歌词.text = "私を越えて
		
					越过我的灵魂"
	
	if 歌曲已到达多少秒 == 131:
		歌词.text = "櫻咲くこの森で
		
					在这樱花盛开的
					森林之中"
	if 歌曲已到达多少秒 == 136:
		歌词.text = "舞い上がる
					因果交流のひかり
					
					因果交流的
					照明交错飞舞"
	if 歌曲已到达多少秒 == 143:
		歌词.text = "きらめくいろにせかい
					が結ばれる
					
					在这闪耀的景色之下
					世界相通相生"
					
	if 歌曲已到达多少秒 == 152:
		歌词.text = "春の雪 そら 
					たかく舞い散る
					
					虚无高远的天际 
					春雪飘落"
	if 歌曲已到达多少秒 == 159:
		歌词.text = "消え去る花かがや
					く息吹き
					
					消逝凋零的花儿 
					洋溢生机"
	if 歌曲已到达多少秒 == 165:
		歌词.text = "君が立つ大地だ 
					花よ咲け 咲き乱れ
					
					花啊绽放吧 盛开吧 
					就在你所立足的大地上"
	if 歌曲已到达多少秒 == 177:
		歌词.text = "光り射す
		
任					凭那光芒四射"
	if 歌曲已到达多少秒 == 180:
		歌词.text = "あらわれる心象を
					スケッチしよう
					
					去描绘那
					闪现的心象哟"
	if 歌曲已到达多少秒 == 185:
		歌词.text = "せかいの限界
					をこえる絵画
					
					画出超越
					现世界限的艺术品"
	if 歌曲已到达多少秒 == 191:
		歌词.text = "標本の蝶々
		
					标本中的蝴蝶"
	if 歌曲已到达多少秒 == 193:
		歌词.text = "よみがえりまた飛び立つ
		
					复苏后又再次翩翩起舞"
	if 歌曲已到达多少秒 == 198:
		歌词.text = "すばらしき刻
		
					这绝妙的印刻"
	if 歌曲已到达多少秒 == 201:
		歌词.text = "瞬間を閉じこめた永遠こそ
		
					将瞬间封存于其中的永恒"
	if 歌曲已到达多少秒 == 207:
		歌词.text = "わたしたちの意味 
					そして意義だと
					
					方才是我们存在的
					价值与意义"
	if 歌曲已到达多少秒 == 212:
		歌词.text = "君は知るだろう
		
					你是知道的吧"
	if 歌曲已到达多少秒 == 218:
		歌词.text = "さぁ うけとるがいい
		
					来吧 在这首樱之诗下"
	if 歌曲已到达多少秒 == 220:
		歌词.text = "永遠の相 この櫻ノ詩の下
		
					用心去体会吧 
					所谓永恒的模样"

func 歌曲_增加_秒数():
	歌曲已到达多少秒 += 1
